[
  {
    "id": 1,
    "title": "Consultant",
    "company": "IBM Consulting",
    "type": "IT",
    "image": "/images/IBM.jpg",
    "date": "2025-09-09",
    "applyLink": "https://ibmglobal.avature.net/en_US/careers/JobDetail?jobId=46439&source=WEB_Search_INDIA",
    "details": {
      "overview": "A career in IBM Consulting is rooted in long-term relationships and close collaboration with clients across the globe. You'll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for some of the most innovative companies in the world.",
      "responsibilities": [
        "Develop application design and provide guidance to project teams on complex coding and issue resolution.",
        "Lead the design and construction of new mobile solutions using the latest technologies.",
        "Strive for continuous improvements by testing build solutions and working in an agile framework.",
        "Discover and implement the latest technology trends to build creative solutions."
      ],
      "qualifications": [
        "Bachelor's Degree (Required), Master's Degree (Preferred).",
        "3-5 years of experience in design and automation for application build and deployment.",
        "Experience with Ansible for deployment automation (e.g., deploying WAR files to Tomcat servers).",
        "Strong knowledge of Unix/Linux, shell scripting, PowerShell, and YAML.",
        "Hands-on experience with Jinja templates, Ansible filters, and Windows/Microsoft ecosystem.",
        "Knowledge of custom Ansible roles and inventory management for multiple environments."
      ],
      "workLocation": "Bengaluru, Karnataka, India",
      "note": "This role is part of IBM Consulting's Client Innovation Center.",
      "howToApply": "Apply via IBM Careers portal."
    }
  },
  {
    "id": 2,
    "title": "Software Engineer II, Infrastructure (Google Cloud)",
    "company": "Google",
    "type": "IT",
    "image": "/images/Google.jpg",
    "date": "2025-09-09",
    "applyLink": "https://www.google.com/about/careers/applications/jobs/results/118360042305921734-software-engineer-ii-infrastructure-google-cloud?location=India&q=%22Software%20Engineer%20II%22",
    "details": {
      "overview": "Google's software engineers develop next-generation technologies that change how billions of users connect, explore, and interact with information. Our products handle information at massive scale, beyond traditional web search.",
      "responsibilities": [
        "Write product or system development code.",
        "Participate in or lead design reviews with peers and stakeholders.",
        "Review code to ensure adherence to best practices in style, accuracy, and testability.",
        "Contribute to documentation and adapt content based on product updates.",
        "Triage product or system issues and resolve by analyzing impact on hardware, network, or services."
      ],
      "qualifications": [
        "Minimum: Bachelor's degree or equivalent practical experience.",
        "1+ year experience in software development (Python, C, C++, Java, JavaScript).",
        "1+ year experience with data structures or algorithms.",
        "Preferred: Master's/PhD in Computer Science or related field.",
        "Experience with large-scale infrastructure, distributed systems, storage, or hardware architecture.",
        "Experience developing accessible technologies."
      ],
      "workLocation": "Bengaluru, Karnataka, India",
      "note": "Full-time role in Google Cloud team.",
      "howToApply": "Apply via the Google Careers portal."
    }
  },
  {
    "id": 3,
    "title": "Software Developer",
    "company": "Zoho",
    "type": "IT",
    "image": "/images/Zoho.png",
    "date": "2025-09-09",
    "applyLink": "https://careers.zohocorp.com/jobs/careers/2803000614929615/Software-Developers?source=CareerSite",
    "details": {
      "overview": "Design and develop high-volume, low-latency applications for mission-critical systems, delivering high-availability and performance. Contribute to all phases of the development lifecycle: concept, design, build, deploy, test, and release to app stores and support.",
      "responsibilities": [
        "Design and develop scalable software solutions.",
        "Write well-designed, testable, and efficient code.",
        "Prepare and produce releases of software components.",
        "Work closely with cross-functional teams for integration.",
        "Support continuous improvement by exploring alternatives and technologies."
      ],
      "qualifications": [
        "Bachelor's degree in Computer Science or related field.",
        "Strong programming skills in C, C++, Java, or similar languages.",
        "Good understanding of OOP principles and data structures.",
        "Ability to work on multiple projects simultaneously.",
        "Knowledge of databases and networking basics."
      ],
      "workLocation": "Chennai, Tamil Nadu, India",
      "note": "Full-time role with opportunities for growth.",
      "howToApply": "Apply via Zoho Careers portal."
    }
  },
  {
  "id": 4,
  "title": "Software Product & Platform Engineering Associate",
  "company": "Accenture",
  "type": "IT",
  "image": "/images/Accenture.jpg",
  "date": "2025-09-09",
  "applyLink": "https://www.accenture.com/in-en/careers/jobdetails?id=ATCI-5115212-S1892199_en&title=Software+Development+Engineer",
  "details": {
    "overview": "As a Software Development Engineer, you will engage in a dynamic environment where you will analyze, design, code, and test various components of application code across multiple clients. Your role involves collaborating with teams to deliver high-quality solutions, performing maintenance, and contributing to the development of innovative features.",
    "responsibilities": [
      "Analyze, design, code, and test multiple components of application code.",
      "Perform maintenance, enhancements, and development work.",
      "Collaborate with cross-functional teams to gather requirements and provide technical insights.",
      "Contribute to design and architecture of software components.",
      "Assist in troubleshooting and debugging issues.",
      "Participate in problem-solving discussions and code reviews."
    ],
    "qualifications": [
      "Educational Qualification: 15 years full-time education.",
      "0–2 years of professional work experience in Embedded C.",
      "Proficiency in C, C++, and Python (good to have scripting knowledge).",
      "Experience in ML, AI, Python toolchains, and libraries like Numpy, Scipy, pandas.",
      "Experience with OpenCV and any microcontroller (ARM/STM32).",
      "Working knowledge of communication protocols (I2C, RS232, SPI).",
      "Familiarity with real-time operating systems and Agile/Scrum methodologies.",
      "Understanding of microcontroller architecture and programming.",
      "Experience with debugging tools and techniques for embedded systems."
    ],
    "workLocation": "Bengaluru, Karnataka, India",
    "note": "This is a full-time role with 0-2 years of experience required in Embedded C.",
    "howToApply": "Apply via Accenture Careers portal."
  }
}
,{
  "id": 5,
  "title": "Graduate Trainee",
  "company": "HCLTech",
  "type": "IT",
  "image": "/images/HCLTech.png",
  "date": "2025-09-08",
  "applyLink": "https://www.naukri.com/job-listings-graduate-trainee-hcltech-nagpur-0-to-1-years-070925002888?src=jobpromo-showcase",
  "details": {
    "overview": "HCL Technologies is hiring Graduate Trainees for its Nagpur location. HCLTech is a global technology company headquartered in Noida with offices in 60 countries and over 223,000 employees. The company delivers industry-leading capabilities in digital, engineering, cloud, and AI across multiple industries.",
    "responsibilities": [
      "Join as a Graduate Trainee in IT & Information Security roles.",
      "Collaborate with cross-functional teams and contribute to IT projects.",
      "Develop professional skills including communication, leadership, and teamwork.",
      "Support continuous learning and contribute to organizational growth."
    ],
    "qualifications": [
      "Any Graduate (2023–2025 pass outs only).",
      "Minimum 60% in both 12th and Graduation.",
      "Eligible regions: Nagpur, Gondia, Aurangabad, Balaghat, Wardha, Jalgaon, Akola, Bhopal, Bhandara, Yavatmal, Indore, Jabalpur, Rewa, Chandrapur, Amravati, Gwalior, Chindwara, Betul."
    ],
    "workLocation": "Nagpur, Maharashtra, India",
    "note": "Candidates are required to share updated profiles and mandatory details (Total experience, Current CTC, Expected CTC, Current location, Native location) via email.",
    "howToApply": "Send your updated resume to Santhakumaran_vijay@hcltech.com, jashima.parvin@hcltech.com, and k.sujitha@hcltech.com."
  }
},
{
  "id": 8,
  "title": "Web Developers",
  "company": "Zoho",
  "type": "IT",
  "image": "/images/Zoho.png",
  "date": "2025-09-08",
  "applyLink": "https://careers.zohocorp.com/jobs/Careers/2803000614913786/Web-Developers?$apply=true&source=CareerSite&$callback_url=https://www.zoho.com/careers/jobdetails/?job_id=2803000614913786",
  "details": {
    "overview": "Zoho Corporation is hiring Graduate Trainees for multiple locations across Tamil Nadu. Zoho is a leading global technology company known for its suite of cloud-based business software products and services, empowering organizations worldwide with solutions in CRM, finance, productivity, and collaboration.",
    "responsibilities": [
      "Develop new components based on design specifications.",
      "Work independently and write maintainable code.",
      "Understand existing code and suggest optimization in terms of functionality and performance.",
      "Work on client frameworks for caching and develop reusable components."
    ],
    "qualifications": [
      "Any Graduate (2023–2025 pass outs).",
      "Strong programming knowledge and problem-solving skills.",
      "Good understanding of software development principles and best practices."
    ],
    "workLocation": "Chennai, Salem, Coimbatore, Tirunelveli, Madurai (Tamil Nadu, India)",
    "note": "Fresh graduates with strong coding skills are encouraged to apply.",
    "howToApply": "Apply through the Zoho Careers portal at https://careers.zohocorp.com/jobs/Careers"
  }
},{
  "id": 9,
  "title": "Technical Support Engineer",
  "company": "Zoho Corp",
  "type": "Technical Support",
  "image": "/images/zoho.png",
  "date": "2025-09-16",
  "applyLink": "https://www.zoho.com/careers/jobdetails/?job_id=2803000614929125",
  "details": {
    "overview": "Zoho Corp is hiring Technical Support Engineers to provide voice-based support to international and domestic customers. Zoho is a global software company known for its cloud-based applications for businesses, headquartered in Chennai, India.",
    "responsibilities": [
      "Provide voice-based support to international/domestic customers over the phone (Inbound and Outbound).",
      "Build a rapport with customers through clear and confident communication.",
      "Focus on customer satisfaction and first-time resolution.",
      "Engage with the technical team to provide faster resolutions to technical issues.",
      "Collaborate with the technical content team to identify gaps in the help module."
    ],
    "qualifications": [
      "Should be willing to work night shifts.",
      "Strong communication skills.",
      "Problem-solving ability and customer-oriented mindset."
    ],
    "workLocation": "Chennai, Salem, Coimbatore, Tirunelveli, Madurai, Tamil Nadu, India",
    "note": "Candidates must be ready for night shifts and possess excellent communication skills.",
    "howToApply": "Apply directly via Zoho Careers portal or share your profile through the provided job link."
  }
},{
  "id": 10,
  "title": "QA Engineer",
  "company": "Zoho Corp",
  "type": "Quality Assurance",
  "image": "/images/zoho.png",
  "date": "2025-09-16",
  "applyLink": "https://www.zoho.com/careers/jobdetails/?job_id=2803000614913581",
  "details": {
    "overview": "Zoho Corp is hiring QA Engineers with experience in manual and automation testing. The company is known for its cloud-based business applications and offers opportunities to work on high-quality software products in India.",
    "responsibilities": [
      "Perform manual and automation testing for software applications.",
      "Create large datasets and conduct rigorous back-end testing.",
      "Validate information as it flows through the system.",
      "Assist developers, support reps, and product managers in debugging issues.",
      "Re-test and verify bugs/issues that have been fixed."
    ],
    "qualifications": [
      "Experience in Java programming (data types, variables, operators, flow control statements, methods, Exception handling, File Handling, Database Operations, OOPS concepts).",
      "Experience with MySQL or PgSQL.",
      "Hands-on experience with Selenium and JMeter.",
      "Strong analytical and problem-solving skills."
    ],
    "workLocation": "Chennai, Salem, Coimbatore, Tirunelveli, Madurai, Tamil Nadu, India",
    "note": "Candidates should be ready to perform both manual and automated testing and handle large datasets.",
    "howToApply": "Apply directly via Zoho Careers portal or share your profile through the provided job link."
  }
}





]
